Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mozi__mozi-016-universal-love-iii__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 爲人君必惠，爲人臣必忠，爲人父必慈，爲人子必孝，爲人兄必友，爲人弟必悌。故君子莫若欲爲惠君、忠臣、慈父、孝子、友兄、悌弟，當若兼之不可不行也。此聖王之道，而萬民之大利也。
en: It is what gives peace to the rulers and sustenance to the people. The gentleman would do well to understand and practise universal love; then he would be gracious as a ruler, loyal as a minister, affectionate as a father, filial as a son, courteous as an elder brother, and respectful as a younger brother. So, if the gentleman desires to be a gracious ruler, a loyal minister, an affectionate father, a filial son, a courteous elder brother, and a respectful younger brother, universal love must be practised. It is the way of the sage-kings and the great blessing of the people.
